tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

tap "facebook/fb"
tap "github/gh"
tap "wix/brew"

brew "openssl@1.1"
brew "aria2"
brew "automake"
brew "coreutils"
brew "libyaml"
brew "readline"
brew "asdf"
brew "bison"
brew "bundletool"
brew "gdbm"
brew "clang-format"
brew "curl"
brew "dnscrypt-proxy", restart_service: true
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "go"
brew "gnupg"
brew "hub"
brew "imagemagick"
brew "jq"
brew "libimobiledevice", args: ["HEAD"]
brew "lua"
brew "mas"
brew "minisign"
brew "mosh"
brew "neovim"
brew "nmap"
brew "pango"
brew "parallel"
brew "peco"
brew "scrcpy"
brew "speedtest-cli"
brew "subversion"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "thefuck"
brew "watchman"
brew "wget"
brew "zsh"
cask "adoptopenjdk8"
cask "android-studio"
cask "google-cloud-sdk"
cask "karabiner-elements"

mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Ka-Block!", id: 1335413823
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835
