tap "cloudflare/cloudflare"
tap "facebook/fb"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "rcmdnk/file"
tap "talal/tap"
tap "wix/brew"
brew "openssl@1.1"
brew "aria2"
brew "automake"
brew "bison"
brew "bundletool"
brew "gdbm"
brew "readline"
brew "chruby"
brew "clang-format"
brew "coreutils"
brew "curl"
brew "dnscrypt-proxy", restart_service: true
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "go"
brew "haskell-stack"
brew "hub"
brew "imagemagick"
brew "jq"
brew "libimobiledevice", args: ["HEAD"]
brew "pango"
brew "libyaml"
brew "lua"
brew "mas"
brew "minisign"
brew "mosh"
brew "n"
brew "neovim"
brew "nmap"
brew "parallel"
brew "peco"
brew "ruby-install"
brew "scrcpy"
brew "speedtest-cli"
brew "subversion"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "thefuck"
brew "tree"
brew "volta"
brew "watchman"
brew "wget"
brew "zsh"
brew "rcmdnk/file/brew-file"
cask "adoptopenjdk8"
cask "android-studio"
cask "bitbar"
cask "discord"
cask "docker"
cask "firefox"
cask "flipper"
cask "font-fira-code"
cask "font-fira-sans"
cask "font-hasklig"
cask "font-jetbrains-mono"
cask "fork"
cask "google-chrome"
cask "google-chrome-dev"
cask "google-cloud-sdk"
cask "insomnia"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "monitorcontrol"
cask "postman"
cask "quicklook-json"
cask "quicklookapk"
cask "rectangle"
cask "stats"
cask "transmission"
cask "tunnelblick"
cask "visual-studio-code"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Ka-Block!", id: 1335413823
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835
