tap "alexstrnik/browserino"
# Library and utilities for processing GIFs
brew "giflib"
# General-purpose data compression with high compression ratio
brew "xz"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library implementing the SSH2 protocol
brew "libssh2"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Collection of portable C++ source libraries
brew "boost"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line tools for fly.io services
brew "flyctl"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Assuan IPC Library
brew "libassuan"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Popular GNU data compression program
brew "gzip"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image manipulation library
brew "jpeg"
# Save disk space by cleaning non-essential files from software projects
brew "kondo"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Multi-format archive and compression library
brew "libarchive"
# Library for encoding and decoding .avif files
brew "libavif"
# Postgres C API library
brew "libpq"
# Apache Kafka C/C++ library
brew "librdkafka"
# C XSLT library for GNOME
brew "libxslt"
# YAML Parser
brew "libyaml"
# Sign files & verify signatures. Works with signify in OpenBSD
brew "minisign"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Remote terminal application
brew "mosh", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Shell command parallelization utility
brew "parallel"
# Perl compatible regular expressions library
brew "pcre"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Utility that provides fast incremental file transfer
brew "rsync"
# Used as a compiler wrapper and avoids compilation when possible
brew "sccache"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Extraction utility for .zip compressed archives
brew "unzip"
# Execute commands when watched files change
brew "watchexec"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Remote terminal with IP roaming
brew "mistertea/et/et"
# Change the dates of several git commits with a single command
brew "potatolabs/git-redate/git-redate"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Web browser focusing on privacy
cask "brave-browser"
# Browserino is a tiny browser selector for MacOS written in SwiftUI
cask "browserino"
# Anthropic's official Claude AI desktop app
cask "claude"
# Write, edit, and chat about your code with AI
cask "cursor"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# System-wide audio equaliser
cask "eqmac"
# Web browser
cask "firefox"
cask "font-juliamono"
cask "font-maple-mono-normal-cn"
# GIT client
cask "fork"
# Desktop client for GitHub repositories
cask "github"
# GitHub notifications on your menu bar
cask "gitify"
# Web browser
cask "google-chrome"
# Tools to protect your emails and files
cask "gpg-suite"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Enable generative AI features in iTerm2
cask "itermai"
# Menu bar calendar
cask "itsycal"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customiser
cask "karabiner-elements"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Discover, download, and run local LLMs
cask "lm-studio"
# Open-source software for live streaming and screen recording
cask "obs"
# Replacement for Docker Desktop
cask "orbstack"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Native GUI tool for relational databases
cask "tableplus"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Web browser
cask "thebrowsercompany-dia"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Multiplayer code editor
cask "zed"
vscode "a-h.templ"
vscode "adrianwilczynski.alpine-js-intellisense"
vscode "ahmadawais.shades-of-purple"
vscode "albbus.t4-app-tools"
vscode "alefragnani.project-manager"
vscode "alexdima.copy-relative-path"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "andys8.jest-snippets"
vscode "arzg.gamut"
vscode "arzg.rustdoc-theme"
vscode "arzg.sema"
vscode "arzg.xcode-theme"
vscode "astro-build.astro-vscode"
vscode "atlassian.atlascode"
vscode "awesomektvn.toggle-semicolon"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bbenoist.nix"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "bit.vscode-bit"
vscode "bmalehorn.shell-syntax"
vscode "bmalehorn.vscode-fish"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "bwbonanno.toggle-character"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "ccy.ayu-adaptive"
vscode "charliermarsh.ruff"
vscode "chenglou92.rescript-vscode"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cierra.livewire-vscode"
vscode "codingyu.laravel-goto-view"
vscode "dae.vscode-mac-color-picker"
vscode "damirka.move-syntax"
vscode "damms005.devdb"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dhruvdh.pale-fire-dark"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "entexa.tall-stack"
vscode "ericsia.pythonsnippets3"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "factory.factory-vscode-extension"
vscode "firsttris.vscode-jest-runner"
vscode "fivethree.vscode-fastlane-snippets"
vscode "florinpatrascu.vscode-elixir-snippets"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "geobomatic.dark-plus-one-monokai"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "githubocto.flat"
vscode "glitchbl.laravel-create-view"
vscode "golang.go"
vscode "gulajavaministudio.mayukaithemevsc"
vscode "hardhacker.hard-hacker-theme"
vscode "hashicorp.terraform"
vscode "heybourn.headwind"
vscode "ihunte.laravel-blade-wrapper"
vscode "irongeek.vscode-env"
vscode "jakebecker.elixir-ls"
vscode "jasonnutter.search-node-modules"
vscode "jdinhlife.gruvbox"
vscode "johnsoncodehk.vscode-tsconfig-helper"
vscode "jtlowe.vscode-icon-theme"
vscode "kogia-sima.vscode-sailfish"
vscode "laravel.vscode-laravel"
vscode "lea21st.vscode-sql-formatter"
vscode "liviuschera.noctis"
vscode "maosantaella.night-wolf"
vscode "matthewpi.caddyfile-support"
vscode "mgtrrz.terraform-completer"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "naoray.laravel-goto-components"
vscode "nathanbarry.rust-gruvbox"
vscode "naumovs.color-highlight"
vscode "nicoespeon.abracadabra"
vscode "nrwl.angular-console"
vscode "nwolverson.ide-purescript"
vscode "nwolverson.language-purescript"
vscode "ocamllabs.ocaml-platform"
vscode "oliiep.nordic-retrowaves"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "onecentlin.laravel5-snippets"
vscode "oouo-diogo-perdigao.docthis"
vscode "open-southeners.laravel-pint"
vscode "orta.vscode-jest"
vscode "pbeast.lanes-navigator"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pgl.laravel-jump-controller"
vscode "pmneo.tsimporter"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "riccardoforina.storybook-helper"
vscode "run-at-scale.terraform-doc-snippets"
vscode "rust-lang.rust-analyzer"
vscode "ryannaddy.laravel-artisan"
vscode "samuelcolvin.jinjahtml"
vscode "sburg.vscode-javascript-booster"
vscode "sdras.night-owl"
vscode "shufo.vscode-blade-formatter"
vscode "siegebell.prettify-symbols-mode"
vscode "steefh.terraform-documentation-links"
vscode "steoates.autoimport"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "tailscale.vscode-tailscale"
vscode "tamasfe.even-better-toml"
vscode "tfsec.tfsec"
vscode "twxs.cmake"
vscode "tzneal.smart-replace"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscjava.vscode-gradle"
vscode "whizkydee.material-palenight-theme"
vscode "wilsonsio.color-vision"
vscode "wmaurer.change-case"
vscode "xdebug.php-debug"
vscode "yo1dog.cursor-align"
vscode "yoavbls.pretty-ts-errors"
vscode "yummygum.city-lights-icon-vsc"
vscode "yummygum.city-lights-theme"
vscode "zamerick.vscode-caddyfile-syntax"
vscode "zenstack.zenstack"
vscode "zxh404.vscode-proto3"
cargo "cargo-watch"
