tap "buildpacks/tap"
tap "cloudflare/cloudflare"
tap "facebook/fb"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "messense/macos-cross-toolchains"
tap "mistertea/et"
tap "oven-sh/bun"
tap "pkgxdev/made"
tap "playcover/playcover"
tap "potatolabs/git-redate"
tap "supabase/tap"
brew "act"
brew "ca-certificates"
brew "libyaml"
brew "openssl@3"
brew "ansible"
brew "giflib"
brew "argocd"
brew "libssh2"
brew "aria2"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "asdf"
brew "bash"
brew "bat"
brew "boost"
brew "caddy"
brew "freetype"
brew "fontconfig"
brew "pcre2"
brew "glib"
brew "pkg-config"
brew "cairo"
brew "cloudflared"
brew "cmake"
brew "openldap"
brew "curl"
brew "deno"
brew "dnsmasq"
brew "folly"
brew "edencommon"
brew "eza"
brew "fd"
brew "harfbuzz"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "goose"
brew "imagemagick"
brew "ios-deploy"
brew "jpeg"
brew "jq"
brew "k3d"
brew "k9s"
brew "kondo"
brew "lcov"
brew "libpq"
brew "librsvg"
brew "libxslt"
brew "lua"
brew "mailhog"
brew "micromamba"
brew "minisign"
brew "mkcert"
brew "mosh", args: ["HEAD"]
brew "neovim"
brew "nginx"
brew "opam"
brew "openapi-generator"
brew "pandoc"
brew "parallel"
brew "pcre"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "subversion"
brew "terminal-notifier"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "watchexec"
brew "wget"
brew "zoxide"
brew "facebook/fb/idb-companion"
brew "mistertea/et/et"
brew "oven-sh/bun/bun"
brew "potatolabs/git-redate/git-redate"
brew "supabase/tap/supabase"
cask "adobe-acrobat-reader"
cask "android-studio"
cask "balenaetcher"
cask "brave-browser"
cask "browserosaurus"
cask "ccleaner"
cask "cf-terraforming"
cask "cloudflare-warp"
cask "dbngin"
cask "discord"
cask "eloston-chromium"
cask "firefox"
cask "flipper"
cask "font-fira-code"
cask "font-ibm-plex-mono"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-juliamono"
cask "fork"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "microsoft-edge"
cask "ngrok"
cask "obs"
cask "orbstack"
cask "rapidapi"
cask "raycast"
cask "sequel-ace"
cask "spotify"
cask "stats"
cask "tailscale"
cask "tomatobar"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zulu11"
vscode "adrianwilczynski.alpine-js-intellisense"
vscode "ahmadawais.shades-of-purple"
vscode "alefragnani.project-manager"
vscode "alexdima.copy-relative-path"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "andys8.jest-snippets"
vscode "arzg.gamut"
vscode "arzg.rustdoc-theme"
vscode "arzg.sema"
vscode "arzg.xcode-theme"
vscode "astro-build.astro-vscode"
vscode "atlassian.atlascode"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "bmalehorn.shell-syntax"
vscode "bmalehorn.vscode-fish"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "Cardinal90.multi-cursor-case-preserve"
vscode "ccy.ayu-adaptive"
vscode "chenglou92.rescript-vscode"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cierra.livewire-vscode"
vscode "codingyu.laravel-goto-view"
vscode "coolbear.systemd-unit-file"
vscode "dae.vscode-mac-color-picker"
vscode "damirka.move-syntax"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dhruvdh.pale-fire-dark"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "entexa.tall-stack"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "firsttris.vscode-jest-runner"
vscode "fivethree.vscode-fastlane-snippets"
vscode "florinpatrascu.vscode-elixir-snippets"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "Geobomatic.dark-plus-one-monokai"
vscode "ghmcadams.lintlens"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "glitchbl.laravel-create-view"
vscode "golang.go"
vscode "GulajavaMinistudio.mayukaithemevsc"
vscode "hashicorp.terraform"
vscode "heybourn.headwind"
vscode "IHunte.laravel-blade-wrapper"
vscode "IronGeek.vscode-env"
vscode "JakeBecker.elixir-ls"
vscode "jasonnutter.search-node-modules"
vscode "jtlowe.vscode-icon-theme"
vscode "kogia-sima.vscode-sailfish"
vscode "matthewpi.caddyfile-support"
vscode "mgtrrz.terraform-completer"
vscode "mikestead.dotenv"
vscode "move.move-analyzer"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "msjsdiag.vscode-react-native"
vscode "naoray.laravel-goto-components"
vscode "NathanBarry.rust-gruvbox"
vscode "naumovs.color-highlight"
vscode "nicoespeon.abracadabra"
vscode "NomicFoundation.hardhat-solidity"
vscode "nrwl.angular-console"
vscode "nwolverson.ide-purescript"
vscode "nwolverson.language-purescript"
vscode "ocamllabs.ocaml-platform"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "onecentlin.laravel5-snippets"
vscode "oouo-diogo-perdigao.docthis"
vscode "open-southeners.laravel-pint"
vscode "Orta.vscode-jest"
vscode "PBeast.lanes-navigator"
vscode "pgl.laravel-jump-controller"
vscode "pmneo.tsimporter"
vscode "Prisma.prisma"
vscode "Ransh.ransh"
vscode "redhat.vscode-yaml"
vscode "riccardoforina.storybook-helper"
vscode "run-at-scale.terraform-doc-snippets"
vscode "rust-lang.rust-analyzer"
vscode "ryannaddy.laravel-artisan"
vscode "samuelcolvin.jinjahtml"
vscode "sburg.vscode-javascript-booster"
vscode "sdras.night-owl"
vscode "serayuzgur.crates"
vscode "shufo.vscode-blade-formatter"
vscode "siegebell.prettify-symbols-mode"
vscode "SteefH.terraform-documentation-links"
vscode "stillat-llc.vscode-antlers"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "Tailscale.vscode-tailscale"
vscode "tamasfe.even-better-toml"
vscode "tfsec.tfsec"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vmsynkov.colonize"
vscode "whizkydee.material-palenight-theme"
vscode "wmaurer.change-case"
vscode "xdebug.php-debug"
vscode "yo1dog.cursor-align"
vscode "YoavBls.pretty-ts-errors"
vscode "Yummygum.city-lights-icon-vsc"
vscode "yummygum.city-lights-theme"
vscode "zenstack.zenstack"
vscode "ZixuanChen.vitest-explorer"
vscode "zxh404.vscode-proto3"
