tap "facebook/fb"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "wix/brew"
brew "openssl@1.1"
brew "libssh2"
brew "aria2"
brew "automake"
brew "coreutils"
brew "libyaml"
brew "asdf"
brew "bison"
brew "bundletool"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "delta"
brew "gdbm"
brew "clang-format"
brew "curl"
brew "dnscrypt-proxy", restart_service: true
brew "exa"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "hub"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "lua"
brew "mas"
brew "minisign"
brew "mosh"
brew "neovim"
brew "nghttp2"
brew "nmap"
brew "pango"
brew "parallel"
brew "peco"
brew "scrcpy"
brew "speedtest-cli"
brew "subversion"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "thefuck"
brew "watchman"
brew "wget"
brew "zsh"
cask "adoptopenjdk8"
cask "android-studio"
cask "fork"
cask "google-cloud-sdk"
cask "insomnia"
cask "iterm2"
cask "itsycal"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "logitech-options"
cask "microsoft-teams"
cask "ngrok"
cask "rectangle"
cask "stats"
cask "transmission"
cask "tunnelblick"
cask "visual-studio-code"
mas "Ads-Free! Desktop", id: 1507534972
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Jira", id: 1475897096
mas "Ka-Block!", id: 1335413823
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835
