tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "act"
brew "openssl@1.1"
brew "libssh2"
brew "aria2"
brew "automake"
brew "coreutils"
brew "libyaml"
brew "asdf"
brew "bat"
brew "gdbm"
brew "clang-format"
brew "curl"
brew "delta"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "hub"
brew "imagemagick"
brew "jq"
brew "lua"
brew "mas"
brew "minisign"
brew "neovim"
brew "parallel"
brew "ripgrep"
brew "speedtest-cli"
brew "subversion"
brew "terminal-notifier"
brew "terraform"
brew "the_silver_searcher"
brew "wget"
cask "firefox"
cask "firefox-developer-edition"
cask "fork"
cask "google-cloud-sdk"
cask "insomnia"
cask "iterm2"
cask "itsycal"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "microsoft-teams"
cask "ngrok"
cask "postico"
cask "rectangle"
cask "stats"
cask "transmission"
cask "tunnelblick"
cask "visual-studio-code"
mas "Ads-Free! Desktop", id: 1507534972
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Jira", id: 1475897096
mas "Ka-Block!", id: 1335413823
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835
